from mcpi.minecraft import Minecraft
mc = Minecraft.create()

# получаем координаты игрока
x, y, z = mc.player.getTilePos()
q = 35, 15
w = 159, 4
e = 35, 3
r = 35, 7
t = 35, 9
y = 35, 6
u = 35, 14
i = 159, 6
o = 159
p = 35, 4
a = 35, 1
s = 159, 14
d = 35
f = 159, 1

# создаем двумерный массив с блоками
blocks = [
    [0, 0, 0, 0, 0, 0, 0, 0, q, 0, 0, 0, 0, 0, q,
        q, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, w, q, 0, 0, q, q, w,
        q, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, q, w, q, 0, w, w, q, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, q, w, q, d, q, w, w, q, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, q, w, w, d, q, w, w, w, q, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, q, p, w, q, q, w, w, w, w, q,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, q, w, w, q, p, w, w, w, w, p, p, q,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, q, p, w, w, p, w, w, w, w, p, p, q,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, q, p, w, q, p, w, w, w, w, w, p, p, p, q,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, q, p, w, p, p, w, w, w, w, q, p, p, p, q,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [q, p, w, q, p, w, p, w, p, w, q, p, p, p, p,
        q, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [q, p, q, p, p, p, p, w, w, q, p, p, p, p, q,
        q, q, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [q, p, p, p, p, o, p, p, p, w, q, w, p, p, q,
        p, p, q, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [q, p, o, d, o, o, p, o, q, d, q, w, p, p, p,
        p, q, q, 0, q, q, q, q, q, 0, 0, 0, 0],
    [0, q, p, d, d, o, o, q, i, d, q, p, p, p, p,
        q, r, r, q, w, p, p, p, p, q, q, 0, 0],
    [0, 0, q, p, q, q, q, d, d, d, q, p, p, p, p,
        q, r, r, q, w, p, p, p, p, p, p, q, 0],
    [0, 0, 0, q, w, w, w, w, q, q, w, f, w, w, p,
        q, t, r, q, w, q, q, q, p, q, p, p, q],
    [0, 0, q, w, f, f, w, w, w, w, w, w, w, w, p,
        q, t, r, t, q, 0, 0, q, p, q, q, p, q],
    [0, w, w, w, w, w, w, w, w, f, f, w, w, w,
        p, e, t, r, t, q, 0, 0, q, 0, 0, q, 0],
    [0, q, w, y, w, w, w, w, w, a, f, p, w, w, p,
        p, q, e, f, t, q, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, q, w, w, w, w, w, q, q, r, r, p, p, w,
        w, w, q, r, r, q, q, 0, 0, 0, 0, 0, 0],
    [0, 0, q, w, w, w, q, q, q, q, r, e, q, w, w,
        w, w, q, r, r, q, p, q, 0, 0, 0, 0, 0],
    [0, 0, 0, q, w, q, 0, 0, q, w, w, w, q, e, w,
        q, q, q, q, i, i, q, p, q, 0, 0, 0, 0],
    [0, 0, 0, 0, q, 0, 0, 0, q, w, w, q, q, e, i,
        r, r, q, i, i, i, i, w, w, q, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, q, p, w, q, i, i, i,
        i, q, q, q, i, i, i, i, q, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, q, p, p, q, i, i, q,
        q, 0, 0, 0, q, i, i, q, u, q, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, q, q, p, p, q, q, u, u, u,
        q, 0, 0, 0, 0, q, q, u, u, q, 0, 0, 0],
    [0, 0, 0, 0, 0, q, p, p, w, q, q, u, u, u, q,
        0, 0, 0, 0, 0, 0, q, u, u, q, 0, 0, 0],
    [0, 0, 0, 0, 0, q, q, q, q, 0, q, q, q, q,
        0, 0, 0, 0, 0, 0, 0, 0, q, q, 0, 0, 0, 0]
]

# устанавливаем блоки
# записываем начальные координаты
x, y, z = mc.player.getTilePos()
start_x = x

# пробегаемся по двумерному массиву
for row in reversed(blocks):
    # пробегаемся по одномерному массиву
    for block in row:
        # устанавливаем блок
        mc.setBlock(x, y, z, block)
        # увеличиваем координату x на 1, чтобы установить следующий блок
        x += 1
        # увеличиваем координату у на 1, чтобы установить следующую строку
    y += 1
    # возвращаем координату x в начальное положение
    x = start_x
